lf_center/common/helper/rbac/MenuHelper.php

SELECT `role_id` FROM `lf_pms_userrole` WHERE `user_id` IN ('2ec4f0f300d9186d55237c961850161c', 'liufan', 'liufan', '$2y$13$xOkvtl/lc7rzJ.iMJSVRyOdEX2drjAGPGiXlwICOuug6S3axU/Fiu', 0, 0) GROUP BY `lf_pms_userrole`.`role_id`
SELECT `a`.* FROM `lf_pms_menu` `a` LEFT JOIN `lf_pms_rolemenu` `b` ON a.menu_id = b.menu_id WHERE `b`.`role_id`='1'
---
	public static function getMenuByUser($userId){
		#尽管一般情况下不会重复，但是这里还是去重了（因为测试的时候假数据还是可能重复的）
		$roleIds = LfPmsUserrole::find()
			->select('role_id')
			->where(['user_id' => $userId])
			->groupBy('{{lf_pms_userrole}}.role_id')
			->asArray()
			->all();
		#存放角色对应的源菜单信息
        $roles = [];
        foreach($roleIds as $value){
            $roles[] = $value['role_id'];
        }

        $menus = LfPmsRolemenu::find()
            ->select('a.*')
            ->from(LfPmsMenu::tableName().' as a')
            ->leftJoin(LfPmsRolemenu::tableName().' `b`', 'a.menu_id = b.menu_id')
            ->where(['IN', 'b.role_id', $roles])
            ->asArray()
            ->all();

SELECT * FROM `lf_pms_menu` WHERE `menu_id`='941f18f4876a44a689021c4052cb586a'
---
	public static function getMenuNameById($menu_id){
		$menu = LfPmsMenu::findOne(['menu_id' => $menu_id]);