lf_center/common/models/LfPmsUser.php

    public static function findIdentity($user_id)
    {
        return static::findOne(['user_id' => $user_id]);
---
SELECT * FROM `lf_pms_user` WHERE `user_id`='2ec4f0f300d9186d55237c961850161c'

    public static function findByUsername($username)
    {
        return static::findOne(['user_name' => $username]);
---
SELECT * FROM `lf_pms_user` WHERE `user_name`='liufan'