lf_center/common/helper/DbHelper.php

	public static function getUserNameById($user_id){
		$user = LfPmsUser::findOne(['user_id' => $user_id]);
---
SELECT * FROM `lf_pms_user` WHERE `user_id`='2ec4f0f300d9186d55237c961850161c'