lf_center/backend/controllers/WxApiController.php

	public function actionGetBanner(){
		$banner = WxPic::find()->where([
			'PIC_POS' => 1
		])->asArray()->all();
---
SELECT * FROM `wx_pic` WHERE `PIC_POS`=1