lf_center/backend/controllers/WxPicController.php

INSERT INTO `wx_pic` (`PIC_URL`, `PIC_POS`, `UTIME`, `UADMIN`) VALUES ('head1.jpg', 1, '2018-04-09 06:23:43', '2ec4f0f300d9186d55237c961850161c')
---
    public function actionCreate()
    {
        $model = new WxPic();

        if ($model->load(Yii::$app->request->post())) {
            $model->UTIME = date('Y-m-d H:i:s', time());
            $model->UADMIN = Yii::$app->user->identity->user_id;
            if($model->save()){

SELECT * FROM `wx_pic` WHERE `ID`='1'
---
    protected function findModel($id)
    {
        if (($model = WxPic::findOne($id)) !== null) {